[
    {
        "name" : "Ted Piorczynski",
        "title": "Impressive debut novel",
        "review": "Excalibur's Pendragon, the first book (of hopefully many) recounting the Aethervard Legacy, introduces an Arthurian-based tale of duty, courage, and love set in an imaginative, fantasy-filled world. Parker's unbridled passion and keen storytelling create a page-turning adventure that marries mature themes with a fun narrative. I am already eagerly awaiting the next addition to the series!",
        "rating": "5"
    },
    {
        "name" : "Taylor",
        "title": "Captivating read that is full of adventure",
        "review": "Loving this book so far! Parker is very creative and an excellent author. Can’t wait to finish this book and for him to publish book number two!!",
        "rating": "5"
    },
    {
        "name" : "BTBingham",
        "title": "Great read from first time author Parker Wilson",
        "review": "I enjoyed reading this book. The genre is high school teenage fantasy. I am familiar with this genre. I have read the Michael Vey series, even the latest #8. Parker’s book, Excalibur’s Pendragon, draws you in and is a good page turner. It is an exciting read where you care about Ryan and the challenges he faces. It is fun to see how Parker creates a modern day story and world around the King Arthur legacy. The story has monsters, wizards, reluctant heroes and villains. It was entertaining. It also has a good message of having faith and hope when making decisions and choosing your own path. I will eagerly await the next book in this series and order it as soon as it comes out.",
        "rating": "5"
    },
    {
        "name" : "Tanner Redding",
        "title": "Amazing!",
        "review": "I hope that this is the first of many in this series. Parker is an incredible author and truly has a gift. His writing transports the reader to another time and place, and this, to me, is what reading is all about. I have loved this book so far and hope that there are many more to come.",
        "rating": "5"
    }
]



