[
    {
        "book_image": "../Images/book_1_front.png",
        "title": "Excalibur's Pendragon: Book One of the Aethervard Legacy",
        "rating": "5",
        "synopsis": "What empowers a legend? What turned a lowly boy into a warrior king? Who says that a new legend can’t be produced in the modern day?\n\nHow could a high school boy like Ryan Walker come to know or care about such things when his soul is broken? Even with the support of his father and friends, he lacks the fortitude to face his inner conflict, a struggle that has worn down his spirit for nearly a year. In Ryan’s eyes, the way forward is impossible.\n\nBut this pain doesn’t spare the troubled boy from the magic trials that await him. Somehow, he is burdened with powers too great for any human to handle, abilities that make him the target of ferocious demons that seek to taste his blood. Try as he might to escape this, Ryan is pulled toward an ancient legacy built upon the sentient sword Excalibur and its servants known as the Pendragons. The more he learns of this legacy, the more he is surrounded by mystic powers, a secret organization, characters from Arthurian lore, and enemies from the enchanted realm of Annwn.\n\nThese extraordinary forces push Ryan to his breaking point, but there is one more challenge that is harder than the rest. Some people are not who they seem, and their secrets could prove harmful when brought to light. This revelation could blow Ryan off course at a time when one deviation can cost him everything.\n\nRegardless of the outcome, whatever path is placed before Ryan by the godlike sentinels of Annwn, what good can he do when he is so eager to reject his calling? How can he become a Chosen One when he feels robbed of the right to choose otherwise? Furthermore, in the event that he is offered that choice, what could possibly dissuade him from taking the way out?\n\nDiscover the answers to these questions and more in the first installment of The Aethervard Legacy!",
        "attributes": [
            {
                "name": "Print length",
                "value": "276 pages"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Dimensions",
                "value": "6 x 0.7 x 9 inches"
            },
            {
                "name": "ISBN-13",
                "value": "979-8986945613"
            }
        ]
    }
]



